PH_data/alpha_1.05/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
18819
(
( 4.195664224e-05 -1.549888475e-05 -9.236792948e-07 3.066250429e-05 -2.082624064e-07 3.623992234e-05 )
( 4.152450128e-05 -1.539878394e-05 -9.649177173e-07 3.026420382e-05 -1.03486002e-07 3.534448115e-05 )
( 3.811181523e-05 -1.229418194e-05 -1.565102025e-06 2.721185047e-05 -2.891957251e-08 3.535598808e-05 )
( 3.763862333e-05 -1.206524303e-05 -1.488617386e-06 2.664893145e-05 -1.656639981e-08 3.456784543e-05 )
( 4.131263267e-05 -1.53385954e-05 -1.049915454e-06 2.97261995e-05 2.973856184e-08 3.46129018e-05 )
( 3.825385284e-05 -1.222664287e-05 -1.757163318e-06 2.77181789e-05 1.214512579e-08 3.646664118e-05 )
( 3.559059041e-05 -9.727797078e-06 -1.784830374e-06 2.409379704e-05 6.362148497e-08 3.548485256e-05 )
( 3.552813359e-05 -9.754518942e-06 -1.749229909e-06 2.389466317e-05 6.911056971e-08 3.513065167e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
