PH_data/alpha_1.05/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          924;
        startFace       54437;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          380;
        startFace       55361;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          27299;
        startFace       55741;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          27299;
        startFace       83040;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          47;
        startFace       110339;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -9.449999809 0 0 );
        lowWeightCorrection 0.009999999776;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          50;
        startFace       110386;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 9.449999809 0 0 );
        lowWeightCorrection 0.009999999776;
    }
)

// ************************************************************************* //
